import { ApiProperty } from '@nestjs/swagger'
import { IsString } from 'class-validator'

export class CreateDAPDto {
  @ApiProperty({
    example: 'Як зробити замовлення?'
  })
  @IsString()
  title: string

  @ApiProperty({
    example: `У супермаркеті «Марка» ви можете оформити замовлення необхідних продуктів дистанційно - онлайн або за телефоном. Вибирайте потрібні товари заздалегідь, а ми все підготуємо для вас!
Найзручніший спосіб замовлення - онлайн, скористайтесь каталогом продуктів на нашому сайті.
Швидко, комфортно і без черг. Просто додавайте все необхідне у кошик, оформлюйте замовлення, а наші працівники в супермаркеті опрацюють його у найкоротші терміни: перевірять наявність продуктів, відберуть для вас найсвіжіше і спакують для подальшої доставки.`
  })
  @IsString()
  text: string
}
